[
  {
    "id": 1,
    "name": "Marketing Strategies",
    "description": "Share and learn marketing tactics to grow your small business brand and reach."
  },
  {
    "id": 2,
    "name": "Funding & Finance",
    "description": "Discuss loans, grants, crowdfunding, and financial management tips for entrepreneurs."
  },
  {
    "id": 3,
    "name": "Operations Efficiency",
    "description": "Tips, tools, and workflows to streamline day-to-day operations."
  },
  {
    "id": 4,
    "name": "Technology for SMEs",
    "description": "Discuss affordable tech tools, automation solutions, and software recommendations."
  },
  {
    "id": 5,
    "name": "Website & SEO",
    "description": "Advice on building, optimizing, and maintaining business websites to attract customers."
  },
  {
    "id": 6,
    "name": "E-Commerce",
    "description": "Strategies for selling products or services online, including platform comparison and setup."
  },
  {
    "id": 7,
    "name": "Advertising",
    "description": "How to run effective online and offline ads that deliver measurable results."
  },
  {
    "id": 8,
    "name": "Branding & Design",
    "description": "Discussions on creating unique brand identity, logos, and visual assets."
  },
  {
    "id": 9,
    "name": "Networking & Partnerships",
    "description": "Find collaborations, strategic partnerships, and referral opportunities."
  },
  {
    "id": 10,
    "name": "Customer Service",
    "description": "Best practices for keeping customers happy and building loyalty."
  },
  {
    "id": 11,
    "name": "Small Business Accounting Basics",
    "description": "Fundamentals of accounting specifically for small businesses."
  },
  {
    "id": 12,
    "name": "Bookkeeping & Record Keeping",
    "description": "Effective methods for maintaining accurate financial records."
  },
  {
    "id": 13,
    "name": "Tax Planning & Compliance",
    "description": "Guidance on tax regulations, planning, and filing for SMEs."
  },
  {
    "id": 14,
    "name": "Payroll Processing",
    "description": "Best practices and tools for managing employee payroll and taxes."
  },
  {
    "id": 15,
    "name": "Budgeting & Forecasting",
    "description": "Techniques to plan and predict your company's financial future."
  },
  {
    "id": 16,
    "name": "Recruitment & Hiring Best Practices",
    "description": "Strategies for attracting and selecting the right talent."
  },
  {
    "id": 17,
    "name": "Employee Onboarding",
    "description": "Effective onboarding processes to integrate new employees successfully."
  },
  {
    "id": 18,
    "name": "HR Compliance & Employment Law",
    "description": "Stay updated on workplace laws, regulations, and compliance requirements."
  },
  {
    "id": 19,
    "name": "Performance Management",
    "description": "Setting goals, evaluations, and improving employee performance."
  },
  {
    "id": 20,
    "name": "Employee Engagement & Retention",
    "description": "Techniques to keep employees motivated and reduce turnover."
  }
]

